UB_Copy/src/InformationRegisters/УБ_ВерсииГрейдов/УБ_ВерсииГрейдов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБ_ВерсииГрейдов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВерсияГрейда</name>
    <type>
      <types>CatalogRef.УБ_ВерсииГрейдов</types>
    </type>
  </resources>
  <resources>
    <name>ПериодРасчетаМоделиПланирования</name>
    <type>
      <types>EnumRef.УБ_ПериодыРасчетаМоделиПланирования</types>
    </type>
  </resources>
  <resources>
    <name>ПредельныйКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.УБ_СтатусыМоделейПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРасчетаПремии</name>
    <type>
      <types>EnumRef.УБ_ВариантыРасчетаПремии</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаПоказателей</name>
    <type>
      <types>CatalogRef.УБ_ШкалыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательРасчетаЗарплатыПриБезокладнойСистеме</name>
    <type>
      <types>DefinedType.УБ_ПоказателиРасчетаЗарплаты</types>
    </type>
  </attributes>
  <dimensions>
    <name>МодельПланированияЭффективности</name>
    <type>
      <types>CatalogRef.УБ_МоделиПланированияЭффективности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Грейд</name>
    <type>
      <types>CatalogRef.УБ_Грейды</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UB_Copy/src/InformationRegisters/УБ_МоделиПланированияСотрудников/УБ_МоделиПланированияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБ_МоделиПланированияСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>МодельПланированияЭффективности</name>
    <type>
      <types>CatalogRef.УБ_МоделиПланированияЭффективности</types>
    </type>
  </resources>
  <resources>
    <name>Грейд</name>
    <type>
      <types>CatalogRef.УБ_Грейды</types>
    </type>
  </resources>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>DefinedType.УБ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КадровыйДокумент</name>
    <type>
      <types>DocumentRef.КадровыйПереводСписком</types>
      <types>DocumentRef.ПриемНаРаботуСписком</types>
      <types>DocumentRef.КадровыйПеревод</types>
      <types>DocumentRef.УБ_НазначениеНаДолжность</types>
      <types>DocumentRef.УБ_ПереводНаДолжность</types>
      <types>DocumentRef.ПриемНаРаботу</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UB_Copy/src/InformationRegisters/УБ_КадроваяИсторияСотрудников/УБ_КадроваяИсторияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБ_КадроваяИсторияСотрудников</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.УБ_Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>DefinedType.УБ_Должности</types>
    </type>
  </resources>
  <resources>
    <name>ДолжностьПоШтатномуРасписанию</name>
    <type>
      <types>DefinedType.УБ_ШтатноеРасписание</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.УБ_ВидыКадровыхСобытий</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>DefinedType.УБ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UB_Copy/src/Enums/УБ_ВидыКадровыхСобытий/УБ_ВидыКадровыхСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УБ_ВидыКадровыхСобытий</name>
  <enumValues>
    <name>Прием</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
</mdclass:Enum>

UB_Copy/src/Catalogs/УБ_ВерсииГрейдов/УБ_ВерсииГрейдов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УБ_ВерсииГрейдов</name>
  <owners>Catalog.УБ_Грейды</owners>
  <attributes>
    <name>ДатаВерсии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

UB_Copy/src/CommonModules/УБ_РаботаСВерсиямиГрейдов/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СоздатьНовуюВерсиюГрейда(Грейд, ПараметрыЗаполнения, Регистратор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВерсииГрейдов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УБ_ВерсииГрейдов КАК ВерсииГрейдов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УБ_ВерсииГрейдов КАК РегистрСведений
		|		ПО ВерсииГрейдов.Ссылка = РегистрСведений.ВерсияГрейда
		|ГДЕ
		|	ВерсииГрейдов.Владелец = &Грейд
		|	И ВерсииГрейдов.ДатаВерсии = &ДатаВерсии
		|	И (РегистрСведений.Регистратор = &Регистратор
		|		ИЛИ РегистрСведений.Статус ЕСТЬ NULL)";
	
	Запрос.УстановитьПараметр("Грейд", Грейд);
	Запрос.УстановитьПараметр("ДатаВерсии", ПараметрыЗаполнения.ДатаВерсии);
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ОбновитьДанныеВерсииГрейда(Выборка.Ссылка, ПараметрыЗаполнения);
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
	Наименование = СтандартноеНаименованиеВерсииГрейда(ПараметрыЗаполнения.ДатаВерсии);
	
	ВерсияГрейдаОбъект = Справочники.УБ_ВерсииГрейдов.СоздатьЭлемент();
	ВерсияГрейдаОбъект.Владелец = Грейд;
	ВерсияГрейдаОбъект.Наименование = Наименование;
	ЗаполнитьЗначенияСвойств(ВерсияГрейдаОбъект, ПараметрыЗаполнения);
	
	ВерсияГрейдаОбъект.Записать();
	
	Возврат ВерсияГрейдаОбъект.Ссылка;
	
КонецФункции

Процедура ОбновитьДанныеВерсииГрейда(ВерсияГрейда, ПараметрыЗаполнения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВерсииГрейдов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УБ_ВерсииГрейдов КАК ВерсииГрейдов
		|ГДЕ
		|	ВерсииГрейдов.Ссылка = &Ссылка
		|	И ВерсииГрейдов.ДатаВерсии = &ДатаВерсии
		|	И ВерсииГрейдов.ВАрхиве = &ВАрхиве";
	
	Запрос.УстановитьПараметр("Ссылка", ВерсияГрейда);
	Запрос.УстановитьПараметр("ДатаВерсии", ПараметрыЗаполнения.ДатаВерсии);
	Запрос.УстановитьПараметр("ВАрхиве", ПараметрыЗаполнения.ВАрхиве);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		НовоеНаименование = СтандартноеНаименованиеВерсииГрейда(ПараметрыЗаполнения.ДатаВерсии);
		
		ВерсияГрейдаОбъект = ВерсияГрейда.ПолучитьОбъект();
		ВерсияГрейдаОбъект.Наименование = НовоеНаименование;
		ЗаполнитьЗначенияСвойств(ВерсияГрейдаОбъект, ПараметрыЗаполнения);
		ВерсияГрейдаОбъект.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПараметрыЗаполненияВерсииГрейда() Экспорт
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ДатаВерсии");
	ПараметрыЗаполнения.Вставить("ВАрхиве", Ложь);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтандартноеНаименованиеВерсииГрейда(ДатаВерсии = '00010101')
	
	ШаблонНаименования = НСтр("ru = 'от &ДатаВерсии'");
	
	Если ЗначениеЗаполнено(ДатаВерсии) Тогда
		НаименованиеВерсии = СтрЗаменить(ШаблонНаименования, "&ДатаВерсии", Формат(ДатаВерсии, "ДФ=dd.MM.yyyy"));
	Иначе
		НаименованиеВерсии = НСтр("ru = '<не утверждена>'");
	КонецЕсли;
	
	Возврат НаименованиеВерсии;
	  
КонецФункции

Функция РазрешитьПоместитьГрейдВАрхив(МодельПланирования, Грейд) Экспорт
	
	Разрешить = ЕстьРаботающиеСотрудникиГрейда(МодельПланирования, Грейд);
	Возврат Разрешить;
		
КонецФункции

Функция ЕстьРаботающиеСотрудникиГрейда(МодельПланирования, Грейд)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УБ_МоделиПланированияСотрудниковСрезПоследних.МодельПланированияЭффективности КАК МодельПланированияЭффективности,
	               |	УБ_МоделиПланированияСотрудниковСрезПоследних.Грейд КАК Грейд,
	               |	УБ_МоделиПланированияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрСведений.УБ_МоделиПланированияСотрудников.СрезПоследних КАК УБ_МоделиПланированияСотрудниковСрезПоследних
	               |ГДЕ
	               |	УБ_МоделиПланированияСотрудниковСрезПоследних.МодельПланированияЭффективности = &МодельПланированияЭффективности
	               |	И УБ_МоделиПланированияСотрудниковСрезПоследних.Грейд = &Грейд";
	Запрос.УстановитьПараметр("МодельПланированияЭффективности",МодельПланирования);
	Запрос.УстановитьПараметр("Грейд",Грейд);
	Результат = Запрос.Выполнить().Выгрузить();
	МассивСотрудников = Результат.ВыгрузитьКолонку("Сотрудник");

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УБ_КадроваяИсторияСотрудниковСрезПоследних.Организация КАК Организация,
	               |	УБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Подразделение,
	               |	УБ_КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность,
	               |	УБ_КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию КАК ДолжностьПоШтатномуРасписанию,
	               |	УБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия КАК ВидСобытия,
	               |	УБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	               |ИЗ
	               |	РегистрСведений.УБ_КадроваяИсторияСотрудников.СрезПоследних КАК УБ_КадроваяИсторияСотрудниковСрезПоследних
	               |ГДЕ
	               |	УБ_КадроваяИсторияСотрудниковСрезПоследних.ДолжностьПоШтатномуРасписанию.МодельПланирования = &МодельПланирования
	               |	И УБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник В(&МассивСотрудников)
	               |	И УБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> &Увольнение";
	Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников);
	Запрос.УстановитьПараметр("МодельПланирования",МодельПланирования);
	Запрос.УстановитьПараметр("Увольнение",Перечисления.УБ_ВидыКадровыхСобытий.Увольнение);
	Результат1 = Запрос.Выполнить().Выгрузить();
	Если Результат1.Количество() = 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;		
	
КонецФункции

#КонецОбласти
